
Процедура ОбработкаПроведения(Отказ, Режим)

	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ДатаОкончания;
		Движение.ПериодРегистрации = НачалоМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала);
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
		Движение.Размер = ТекСтрокаОсновныеНачисления.Размер;
		Если Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Командировка Тогда
			Движение.БазовыйПериодНачало = ДобавитьМесяц(Движение.ПериодРегистрации, -2);
			Движение.БазовыйПериодКонец = Движение.ПериодРегистрации - 1;
		КонецЕсли;
		Движение.Часы = 0;
	КонецЦикла;
	Движения.ОсновныеНачисления.Записать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ИзмеренияОсновного = Новый Массив;
	ИзмеренияОсновного.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("ИзмеренияОсновного", ИзмеренияОсновного);

	ИзмеренияБазового = Новый Массив;
	ИзмеренияБазового.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("ИзмеренияБазового", ИзмеренияБазового);
	
	Разрезы = Новый Массив;
	//Разрезы.Добавить("");
	Запрос.УстановитьПараметр("Разрезы", Разрезы);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДГ.ПериодРегистрации КАК ПериодРегистрации,
	|	ДГ.Регистратор КАК Регистратор,
	|	ДГ.НомерСтроки КАК НомерСтроки,
	|	ДГ.ВидРасчета КАК ВидРасчета,
	|	ДГ.ПериодДействия КАК ПериодДействия,
	|	ДГ.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ДГ.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ДГ.Активность КАК Активность,
	|	ДГ.Сторно КАК Сторно,
	|	ДГ.Сотрудник КАК Сотрудник,
	|	ДГ.Сумма КАК Сумма,
	|	ДГ.Часы КАК Часы,
	|	ДГ.ЗначениеПериодДействия КАК ЗначениеПериодДействия,
	|	ДГ.ЗначениеФактическийПериодДействия КАК ЗначениеФактическийПериодДействия,
	|	ДГ.ЗначениеПериодРегистрации КАК ЗначениеПериодРегистрации
	|ПОМЕСТИТЬ ВТ_ДГ
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ДГ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	База.ПериодРегистрации КАК ПериодРегистрации,
	|	База.Регистратор КАК Регистратор,
	|	База.НомерСтроки КАК НомерСтроки,
	|	База.ВидРасчета КАК ВидРасчета,
	|	База.ПериодДействия КАК ПериодДействия,
	|	База.ПериодДействияНачало КАК ПериодДействияНачало,
	|	База.ПериодДействияКонец КАК ПериодДействияКонец,
	|	База.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	База.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	База.Активность КАК Активность,
	|	База.Сторно КАК Сторно,
	|	База.Сотрудник КАК Сотрудник,
	|	База.Сумма КАК Сумма,
	|	База.Часы КАК Часы
	|ПОМЕСТИТЬ ВТ_База
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.БазаОсновныеНачисления(&ИзмеренияОсновного, &ИзмеренияБазового, , ) КАК База
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_База.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТ_База.Регистратор КАК Регистратор,
	|	ВТ_База.НомерСтроки КАК НомерСтроки,
	|	ВТ_База.ВидРасчета КАК ВидРасчета,
	|	ВТ_База.ПериодДействия КАК ПериодДействия,
	|	ВТ_База.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ВТ_База.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ВТ_База.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	ВТ_База.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	ВТ_База.Активность КАК Активность,
	|	ВТ_База.Сторно КАК Сторно,
	|	ВТ_База.Сотрудник КАК Сотрудник,
	|	ВТ_База.Сумма КАК Сумма,
	|	ВТ_База.Часы КАК Часы
	|ИЗ
	|	ВТ_База КАК ВТ_База
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОН.ПериодРегистрации КАК ПериодРегистрации,
	|	ОН.Регистратор КАК Регистратор,
	|	ОН.НомерСтроки КАК НомерСтроки,
	|	ОН.ВидРасчета КАК ВидРасчета,
	|	ОН.ПериодДействия КАК ПериодДействия,
	|	ОН.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ОН.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ОН.Активность КАК Активность,
	|	ОН.Сторно КАК Сторно,
	|	ОН.Сотрудник КАК Сотрудник,
	|	ОН.Сумма КАК Сумма,
	|	ОН.Часы КАК Часы,
	|	ЕСТЬNULL(ВТ_ДГ.ЗначениеФактическийПериодДействия, 0) КАК ЧасыФакт,
	|	ЕСТЬNULL(ВТ_ДГ.ЗначениеПериодДействия, 0) КАК ЧасыГрафик,
	|	ЕСТЬNULL(ВТ_ДГ.ЗначениеПериодРегистрации, 0) КАК ЗначениеПериодРегистрации,
	|	ЕСТЬNULL(ВТ_База.Часы, 0) КАК БазаЧасы,
	|	ЕСТЬNULL(ВТ_База.Сумма, 0) КАК БазаСумма
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления КАК ОН
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДГ КАК ВТ_ДГ
	|		ПО ОН.НомерСтроки = ВТ_ДГ.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_База КАК ВТ_База
	|		ПО ОН.НомерСтроки = ВТ_База.НомерСтроки
	|ГДЕ
	|	ОН.Регистратор = &Ссылка";
	Результаты = Запрос.ВыполнитьПакет();
	Результат = Результаты[3];
	Выборка = Результат.Выбрать();
	Для Каждого ТекДвижение Из Движения.ОсновныеНачисления Цикл
		Если ТекДвижение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
			Выборка.Сбросить();
			Если Выборка.НайтиСледующий(ТекДвижение.НомерСтроки, "НомерСтроки") Тогда
				ТекДвижение.Часы = Выборка.ЧасыФакт;
				ТекДвижение.Сумма = ?(Выборка.ЧасыГрафик = 0, 0, ТекДвижение.Размер * ТекДвижение.Часы / Выборка.ЧасыГрафик);
			КонецЕсли;
		ИначеЕсли ТекДвижение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Командировка Тогда
			к = 3;
		КонецЕсли;
	КонецЦикла;
	Движения.ОсновныеНачисления.Записать(, Ложь);
	
КонецПроцедуры
